---
kind: type
id: T:Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent
source: html/884c376f-fc96-d8da-fe84-cdde31a6f81c.htm
---
# Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent

This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined
 by a TriangulatedShellComponent.

## Syntax (C#)
```csharp
public class TriangulationInterfaceForTriangulatedShellComponent : TriangulationInterface
```

## Remarks
Compare to TriangulationInterfaceForTriangulatedSolidOrShell, which treats with the entire solid or shell as
 a single triangulated structure.